harrison_ford_ii/app/views/vehicles/index.html.erb

    <!--<p>
      <h3> QOH: <%= pluralize(@vehicles.size, 'Vehicle') %></h3>
---
SELECT "vehicles".* FROM "vehicles"
SELECT COUNT(*) FROM "vehicles"