harrison_ford_iii/app/controllers/clients_controller.rb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "clients" SET "last_name" = ?, "updated_at" = ? WHERE "clients"."id" = ?  [["last_name", "Estelle"], ["updated_at", "2018-03-12 23:46:25.203557"], ["id", 2]]
---
  def update
  	@client = Client.find(params[:id])
    if @client.update(client_params)