harrison_ford_iii/app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "active" = ?, "hire_date" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["active", "t"], ["hire_date", "2018-02-14"], ["updated_at", "2018-03-10 22:22:10.713346"], ["id", 1]]
---
  def update
  	@employee = Employee.find(params[:id])
    if @employee.update(employee_params)

INSERT INTO "employees" ("first_name", "last_name", "email_address", "active", "employee_image_file", "sales_team", "created_at", "updated_at", "hire_date") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @employee = Employee.new(employee_params)
    if @employee.save

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 4]]
---
  def destroy
    @employee = Employee.find(params[:id])
    @employee.destroy