harrison_ford_iii/app/controllers/sessions_controller.rb

  def create
    admin = Admin.find_by(email: params[:email])
---
SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "sam@example.com"], ["LIMIT", 1]]