harrison_ford_iii/app/controllers/transactions_controller.rb

INSERT INTO "transactions" ("employee_id", "created_at", "updated_at", "date_completed", "client_name", "vehicle") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @transaction = @employee.transactions.new(transaction_params)
    if @transaction.save

SELECT  "employees".* FROM "employees" ORDER BY "employees"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def set_employee
    @employee = Employee.first