harrison_ford_iii/app/views/clients/_form.html.erb

    <p>
      <%= collection_select(:client, :employee, Employee.all, :id, :full_name_displayed, prompt: true) %>
---
SELECT "employees".* FROM "employees"