harrison_ford_ii/app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)
    if @customer.save
---
INSERT INTO "customers" ("cfirstname", "clastname", "caddress_line_one", "caddress_line_two", "caddress_line_three", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)