harrison_ford_iii/app/views/employees/show.html.erb

  	<strong>Number of Sales to Date:</strong>
        <%= @employee.transactions.size.to_i %>
---
SELECT SUM(transactions) FROM "transactions" WHERE "transactions"."employee_id" = ?  [["employee_id", 1]]