harrison_ford_iii/app/views/transactions/index.html.erb

SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <p>
        <strong>Date:</strong> <%= transaction.date_completed %> | <strong><%= transaction.client.first_name %> <%= transaction.client.last_name %></strong> | <strong>Vehicle:</strong> <%= transaction.vehicle %>